#+BEGIN_EXPORT html
---
layout: page
title: Install Selenium
tagline: " onto Debian12 host"
permalink: /python/selenium/installation.html
categories: [Python, Debian12, Selenium]
tags: [installation, set-up, config]
---
#+END_EXPORT

#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2


* Installation

Check-up =Selenium= in the list of the /native/ =Debian= packages:

#+begin_src sh :results output :exports both
apt-cache search elpa* | grep selenium 2>&1
#+end_src

#+RESULTS:

There is no one appropriate enough, thus, just follow [[https://github.com/password123456/setup-selenium-with-chrome-driver-on-ubuntu_debian][this manual]],
*but* using a /separate virtual environment/ beforehand:

#+begin_src sh :results output :exports both
  cd ~/.local/
  virtualenv VirtSel
#+end_src


* Testing
First of all lets activate our new =venv=:
#+begin_src elisp
  (pyvenv-activate "~/.local/VirtSel/")
#+end_src

#+RESULTS:

#+begin_src sh :results output :exports both
pip3 list 2>&1
#+end_src

#+RESULTS:
#+begin_example
Package            Version
------------------ -----------
attrs              23.2.0
certifi            2024.2.2
charset-normalizer 3.3.2
h11                0.14.0
idna               3.6
outcome            1.3.0.post0
packaging          24.0
pip                23.0.1
PySocks            1.7.1
python-dotenv      1.0.1
requests           2.31.0
selenium           4.18.1
setuptools         66.1.1
sniffio            1.3.1
sortedcontainers   2.4.0
trio               0.25.0
trio-websocket     0.11.1
typing_extensions  4.10.0
urllib3            2.2.1
webdriver-manager  4.0.1
wheel              0.38.4
wsproto            1.2.0
#+end_example

#+begin_src python :results output :exports both
  from selenium import webdriver
  from selenium.webdriver.chrome.options import Options
  from selenium.webdriver.chrome.service import Service
  from webdriver_manager.chrome import ChromeDriverManager

  options = Options()
  options.add_argument('--headless')
  options.add_argument('--no-sandbox')
  options.add_argument('--disable-dev-shm-usage')
  driver = webdriver.Chrome(service=Service(ChromeDriverManager().install()), options=options)

  driver.get("https://python.org")
  print(driver.title)
  driver.close()
#+end_src

#+RESULTS:
: Welcome to Python.org
